import java.util.*;

public class Main1 
{
    public static void main(String[] args) 
    {
        // יוצרים מערך דו מימדי ומציבים את הערכים שקיבלנו במשימה ואחרי זה נתחיל לסדר אחרי שהצבנו

        double[][] Array = {{4, 5, 15.25, 7}, {2, 0.5, 0.3}, {11.9, 30.2}};
        
        // הלולאה הזאתי שעוברת על כל השורות במערך

        for (int i = 0; i < Array.length; i++) 
        {
            // הלולאה השנייה עוברת על כל האיברים בשורה הנוכחית עד האיבר הלפני אחרון

            for (int j = 0; j < Array[i].length - 1; j++) 
            {
                 // והלולאה האחרונה מבצעת את האלגוריתם של בובל סורט על השורה הנוכחית

                for (int k = 0; k < Array[i].length - j - 1; k++) 
                {
                    // אם האיבר הנוכחי גדול מהאיבר הבא מחליפים ביניהם

                    if (Array[i][k] > Array[i][k + 1]) 
                    {
                        double TempValue = Array[i][k];

                        Array[i][k] = Array[i][k + 1];

                        Array[i][k + 1] = TempValue;
                    }
                }
            }
        }

        // מה שעשינו כאן בעצם זה סידור המערכים הקטנים על פפי גודל המספר ועכשיו נסדר מיון חיצוני על פי מיון סכום של המערכים הפנימים

        // הלולאה הזאתי עוברת על כל איבר המערך החל מהאיבר הראשון עד האיבר השני לפני האחרון

        for (int i = 0; i < Array.length - 1; i++) 
        {
            // הלולאה הזאתי עוברת על כל איבר לאחר האיבר הנוכחי

            // המשתנה ג׳יי משמש כאינדקס לעקיבה אחר האיבר שאליו אנו משווים את האיבר הנוכחי

            for (int j = i + 1; j < Array.length; j++) 
            {
                double sumI = 0; // משתנה זה ישמש לאחסון סכום הערכים במערך הפנימי של האיבר הנוכחי

                double sumJ = 0; // משתנה זה ישמש לאחסון סכום הערכים במערך הפנימי של האיבר שאליו אנו משווים

                for (double ValueI : Array[i]) 
                {
                    // הלולאה הזאת עוברת על כל ערך בתוך המערך הפנימי של האיבר הנוכחי בכל איטרציה, ערך זה מתווסף למשתנה סאם איי, וכך מתבצע חישוב סכום הערכים במערך הפנימי
                    sumI += ValueI;
                }

                for (double ValueJ : Array[j]) 
                {
                    // לולאה זו עוברת על כל ערך בתוך המערך הפנימי של האיבר שאליו אנו משווים סאם איי בדומה ללולאה הקודמת, ערך זה מתווסף למשתנה סאם ג׳יי, וכך מתבצע חישוב סכום הערכים במערך הפנימי.
                    sumJ += ValueJ;
                }

                if (sumI > sumJ) 
                {
                    double[] TempArray = Array[i];

                    Array[i] = Array[j];

                    Array[j] = TempArray;

                    // תנאי זה בודק האם סכום הערכים במערך הפנימי של האיבר הנוכחי סאם איי גדול מסכום הערכים במערך הפנימי של האיבר שאליו אנו משווים סאם ג׳יי
                    // אם התנאי מתקיים, משמעות הדבר היא שהמערך הפנימי של האיבר הנוכחי מכיל סכום גבוה יותר
                }
            }
        }

        // ובסוף נדפיס את המערך
        System.out.println(Arrays.deepToString(Array)); 
    }
}
